;; -*- no-byte-compile: t; -*-
;;; .doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:host github :repo "username/repo"))
;; (package! builtin-package :disable t)

;;(package! geiser-guile)
;; (package! skeletor)
;;(package! guix)

(package! org-super-agenda)
(package! org-bullets)
(package! modus-themes)
(package! ef-themes)
(package! rfc-mode)
(package! lsp-java)
(package! org-mime)
(package! pass)
(package! dired-single)
(package! mvn)
(package! rainbow-mode)
(package! s)
(package! f)
(package! protobuf-mode)
(package! guix :recipe (:host github :repo "alezost/guix.el"))
(package! info-colors)
(package! org-modern :recipe (:host github :repo "minad/org-modern"))
(package! gptel :recipe (:host github :repo "karthink/gptel"))
(package! ement :recipe (:host github :repo "alphapapa/ement.el"))
(package! catppuccin-theme)
(package! doom-nano-modeline :recipe (:host github :repo "ronisbr/doom-nano-modeline"))
(package! devdocs :recipe (:host github :repo "astoff/devdocs.el"))
(package! verb :recipe (:host github :repo "federicotdn/verb"))
