;; -*- no-byte-compile: t; -*-
;;; .doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:host github :repo "username/repo"))
;; (package! builtin-package :disable t)

(package! org-super-agenda)
(package! org-bullets)
(package! org-fancy-priorities)
(package! modus-operandi-theme)
(package! modus-vivendi-theme)
(package! rfc-mode)
(package! lsp-java)
(package! leetcode)
(package! org-mime)
(package! pass)
(package! dired-single)
(package! rainbow-mode)
(package! mvn)
(package! skeletor)
